<template>
    <p class="content" :key="content_.id" v-for="content_ in content">
        {{content_}}<br />
    </p>
</template>

<script>
export default {
  name: "About",
  props: {},
  data() {
    return {
      content: "",
    };
  },
  methods: {},
  created() {
    this.content =[
      "作為一個典型的香港小子，我從小，便在接受港式教育，那是一個操練成績至上的，只有不斷催谷才能進入大學的＂社會遊戲＂，但是，人的特性是不同的，人的稟賦，才能，性格，思維都是不盡相同的。既然作為當年公開試成績很差的學生，卻竟透過非聯招由職訓局晉升至理工大學，因此覺得有必要幫助昔日像自己，覺得迷惘的學生，這就是網站的緣由了！教育制度呀！不知你扼殺了多少創意，熱情，天馬行空的人，讓他們變得自我否定，沒有自信，反而相信自己是失敗者，于是在社會像[鬥敗了的狗／underdog]的人規矩，小心翼翼，沒有意義和感受的活著！你們是不會理解考試制度對我所造成的青年陰影的了!",
      "教育是我一個極關心的議題，德 智 體 群 美 靈，或者二元簡化為品德和才智。如果你在香港考過會考和高考公開試，你一定會明白，什麼叫人性的醜惡！可惜，昔日的筆者也不例外，也是今天筆者看不起的人，筆者明白考生是可以共和相處，如果沒記錯應該是2010年！別說中學階段，就是在我超齡地讀大學時，也受過這種醜陋的人性粗暴對待！如果卑鄙陰謀是智慧的終極，那麼，編程，數學，哲學，想像力和好奇心就毫無價值了。如果讀者愈明白若干人性，心理和人際關係的知識，一定可以改變這種對公民成長時期的負面影響！讀者理解我的動機，即使對讀者產生那怕是零星的認知改變，足以讓筆者振奮，算了還一個心願！",
      "成長路上，共勉之！"
    ];
  },
};
</script>
<style scoped>
</style>